### Prepping Data Challenge: Answer Smash (week 22)


### Requirements
 - Input the data
 - The category dataset requires some cleaning so that Category and Answer are 2 separate fields 
 - Join the datasets together, making sure to keep an eye on row counts 
 - Filter the data so that each answer smash is matched with the corresponding name and answer 
 - Remove unnecessary columns
 - Output the data

In [1]:
import pandas as pd

In [2]:
#Input the data

with pd.ExcelFile('WK22-Answer Smash Input.xlsx') as xlsx:
    ans = pd.read_excel(xlsx, 'Answer Smash')
    names = pd.read_excel(xlsx, 'Names')
    questions = pd.read_excel(xlsx, 'Questions')
    cate = pd.read_excel(xlsx, 'Category')

In [3]:
ans.head()

   Q No                             Answer Smash
0     1                       Mo Hassnow leopard
1     2                  Kelly Gilbert and ernie
2     3                          Arsenergy units
3     4                Nicolas Mieszalymph nodes
4     5  Amalia García-Vellido Santíastrophysics

In [4]:
names.head()

                            Name
0                       Mo Hassn
1                  Kelly Gilbert
2                         Arsene
3               Nicolas Mieszaly
4  Amalia García-Vellido Santías

In [5]:
questions.head()

   Q No    Category                                           Question
0     1     Animals    Which mammal has the latin name panthera uncia?
1     2  Characters                 Name the famous Sesame Street duo.
2     3     Science           What are joules or therms an example of?
3     4     Science  What parts of the body contain immune cells to...
4     5     Science  Which branch of space science applies the laws...

In [6]:
cate.head()

                 Category: Answer
0               Animals: Aardvark
1               Companies: Amazon
2  Companies: Annies Burger Shack
3           Science: Astrophysics
4       Companies: Barnes & Noble

In [7]:
# The category dataset requires some cleaning so that Category and Answer are 2 separate fields
cate[['Category','Answer']] = cate['Category: Answer'].str.split(':', expand = True)
cate.drop('Category: Answer', axis=1, inplace=True)

In [8]:
#Join the datasets together, making sure to keep an eye on row counts 
# find the name for each answer smash
ans['Name'] = [[n for n in names['Name'] if s.lower().startswith(n.lower())] 
                 for s in ans['Answer Smash']]
ans = ans.explode('Name')

In [9]:
# find the answer for each answer smash
ans['Answer'] = [[a for a in cate['Answer'] if s.lower().endswith(a.strip().lower())] 
                   for s in ans['Answer Smash']] 
ans = ans.explode('Answer')

In [10]:
# join the ans to the questions
ans = pd.merge(ans, questions, on='Q No', how='left', indicator=True)

In [11]:
ans = ans[['Q No', 'Name', 'Question', 'Answer', 'Answer Smash']]

In [12]:
ans.head()

,Q No,Name,Question,Answer,Answer Smash
0,1,Mo Hassn,Which mammal has the latin name panthera uncia?,Snow leopard,Mo Hassnow leopard
1,2,Kelly Gilbert,Name the famous Sesame Street duo.,Bert and Ernie,Kelly Gilbert and ernie
2,3,Arsene,What are joules or therms an example of?,Energy units,Arsenergy units
3,4,Nicolas Mieszaly,What parts of the body contain immune cells to...,Lymph nodes,Nicolas Mieszalymph nodes
4,5,Amalia García-Vellido Santías,Which branch of space science applies the laws...,Astrophysics,Amalia García-Vellido Santíastrophysics

In [13]:
ans.to_csv('WK22-output.csv', index=False)